/*******************************************************************************
* MCU型 号: STM32F1XX
* 文 件 名: cpu.c
* 创 建 者: Keda Huang
* 版    本: V1.0
* 创建日期: 2016-08-23
* 文件说明: CPU底层实现
*******************************************************************************/

#include "cpu.h"

static void prvSystemClockConfig(void);
/*******************************************************************************

                                    接口函数

*******************************************************************************/
/*CPU初始化*/
void cpu_Init(void)
{
    /*使能堆栈8字节对齐*/
    SCB->CCR |= SCB_CCR_STKALIGN_Msk;
    /*配置优先级分组, 4位抢占优先级*/
    cpu_NVIC_SetPriorityGrouping(3);
    /*系统时钟配置*/
    prvSystemClockConfig();
    /*初始化CPU节拍*/
    cpu_TickInit();
}

/*******************************************************************************

                                    私有函数

*******************************************************************************/
/*系统时钟配置*/
static void prvSystemClockConfig(void)
{
    /*
        在SystemInit()函数中, 实现了:
        1.复位时钟配置
        2.可选的外部SRAM初始化
        3.内部Flash预取缓存和等待状态设置
        4.CPU系统的时钟初始化
        5.中断向量表偏移设置
    */
    SystemCoreClockUpdate();
    CPU_Assert(CPU_FREQ_HZ == SystemCoreClock);
}
